"""
1 проектиге 1 жолу колдонуучу функциялар
"""

# git init - локалдуу турдо репезиторий ачат.
# git remote add origin ссылка
# .gitignore


"""
регулярдуу турдо колдонулган функциялар
"""

# git status - проектининин файлы гитхабка жуктолгонун текшерет
# git add . / namefile --- файлды гитке жуктойт локалдуу
# git commit -m "comment" --- файлды сохранить кылат
# git push origin master / main --- проектини репезиторийге жүктөйт


"""Delete file"""
# git rm --cached namefile - жонокой файлдарды өчүрүү
# git rm --cached -r namefile - папканы өчүрсөк


"""Команда менен иштегенде керектелүүчү методдор"""
# git branch --- бутакты текшерүү
# git branch name --- бутак ачуу
# git checkout name --- бутакка өтүү үчүн колдонулат
# git checkout -b name --- жаны бутак ачып, ал бутакка автоматтуу түрдө өтөт

# git merge name --- жазылган бутактагы файлдарды master бутагына жүктөйт

